# طلب إدخال بداية المدى من المستخدم وتحويلها لعدد صحيح
num1 = int(input("enter range start: "))

# طلب إدخال نهاية المدى من المستخدم وتحويلها لعدد صحيح
num2 = int(input("enter range end: "))

# متغير لتخزين عدد الأرقام التي تقبل القسمة على 3 و 5
counter = 0

# حلقة for للمرور على كل رقم من البداية للنهاية (مع إضافة +1 لأن النهاية غير مشمولة)
for i in range(num1, num2 + 1):

    # شرط للتأكد أن الرقم يقبل القسمة على 3 و 5 معًا
    if i % 3 == 0 and i % 5 == 0:
        
        # في حالة تحقق الشرط نزيد العداد بمقدار 1
        counter += 1

# طباعة عدد الأرقام التي تقبل القسمة على 3 و 5 داخل المدى
print("count numbers divisible by 3 and 5 is: ", counter)
